<?php
//  ===================================================================================== Перегрузка и магические методы
//  Перегрузка в PHP дает возможность динамически "создавать" свойства и методы. Такие методы и свойства обрабатываются
//  с помощью "волшебных" методов, которые можно создать в классе для различных видов действий.
//  ========== Перегрузка свойств
//  Обращения к свойствам объекта могут быть перегружены с использованием методов __get и __set. Эти методы будут
//  срабатывать в том случае, если объект не содержит свойства, к которому осуществляется доступ.
































